---
kind: property
id: P:Autodesk.Revit.DB.GuidEnum.Guid
source: html/bc40d585-4c79-959e-5de2-0fe093c89bd1.htm
---
# Autodesk.Revit.DB.GuidEnum.Guid Property

The Guid of GUID-based enum object.

## Syntax (C#)
```csharp
public Guid Guid { get; }
```